Tekla Open API Reference for Tekla Structures 2025
StraightDimension.StraightDimensionAttributes Class
 The StraightDimensionAttributes class contains the attributes of the straight dimension.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StraightDimensionAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class StraightDimensionAttributes
	Inherits AttributesBase
The StraightDimension.StraightDimensionAttributes type exposes the following members.
Constructors
Name | Description
StraightDimension.StraightDimensionAttributes
Initializes a new instance of the StraightDimension.StraightDimensionAttributes class
Top
Properties
Name | Description
DimensionValuePostfix
 The postfix for the dimension's value.
DimensionValuePrefix
 The prefix for the dimension's value.
Exaggeration
 The exaggeration attributes of the dimension.
MiddleLowerTag
 The dimension tag placed under the dimension value.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 The attributes can't be loaded.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace